"Скорость лодки в стоячей воде V км/ч, скорость течения реки U км/ч"
"(U < V). Время движения лодки по озеру T1 ч, а по реке (против течения) — T2 ч. Определить"
"путь S, пройденный лодкой (путь = время • скорость). Учесть, что при движении против"
"течения скорость лодки уменьшается на величину скорости течения."


try:
    while true:
        V= int (input(""))
        U=int (input(""))
        T1=int (input(""))
        T2=int (input(""))
        if U<V:
            S1=T1*V
            S2=T2*(V-U)
        else:
            print("Неверные значения")
except:
    print("Ошибка")